app/Controllers/AdminController.php

    public function user()
    {
        $model = new UserModel();

        // 1. Data Jurusan (untuk dropdown)
        $daftar_jurusan = [
            ['kode' => 'J01', 'nama' => 'Teknik Sipil'], ['kode' => 'J02', 'nama' => 'Teknik Mesin'],
            ['kode' => 'J03', 'nama' => 'Teknik Elektro'], ['kode' => 'J04', 'nama' => 'Teknik Kimia'],
            ['kode' => 'J05', 'nama' => 'Teknik Komputer'], ['kode' => 'J06', 'nama' => 'Akuntansi'],
            ['kode' => 'J07', 'nama' => 'Administrasi Bisnis'], ['kode' => 'J08', 'nama' => 'Manajemen Informatika'],
            ['kode' => 'J09', 'nama' => 'Bahasa Inggris'], ['kode' => 'J10', 'nama' => 'Agribisnis']
        ];

        // 2. Ambil prodi lengkap dari fungsi yang sudah ada
        $prodi_list = $this->_getCompleteProdiList();

        // 3. Kelompokkan prodi berdasarkan jurusan_kode untuk JavaScript
        $prodi_grouped = [];
        foreach ($prodi_list as $prodi) {
            // Value untuk dropdown prodi akan menjadi: "Nama Prodi/Jenjang"
            $prodi['value'] = $prodi['nama_prodi'] . '/' . $prodi['jenjang'];
            // Teks yang ditampilkan di dropdown: "Nama Prodi (Jenjang)"
            $prodi['text'] = $prodi['nama_prodi'] . ' (' . $prodi['jenjang'] . ')';
            $prodi_grouped[$prodi['jurusan_kode']][] = $prodi;
        }

        $data = [
            'title'           => 'Master Data User',
            'page'            => 'user',
            'user_list'       => $model->findAll(),
---
SELECT *
FROM `users`