app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@polsri.ac.id'
 LIMIT 1
---
    public function processLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $role_form = $this->request->getPost('role'); // Role dari form (hidden input)

        $model = new UserModel();
        $user = $model->where('email', $email)->first();